package main

import "fmt"

// Одне яблуко коштує 5.99 грн. Ціна однієї груші - 7 грн.
// Ми маємо 23 грн.
// 1. Скільки грошей треба витратити, щоб купити 9 яблук та 8 груш?
// 2. Скільки груш ми можемо купити?
// 3. Скільки яблук ми можемо купити?
// 4. Чи ми можемо купити 2 груші та 2 яблука?
//
// Задача:
// Опишіть вирішення всіх пунктів задачі використовуючи необхідні змінні чи/та константи.
// Під опишіть, я маю на увазі наступне:
// Я маю збілдити ваш код і запустити програму. В результаті цього, я маю побачити роздруковані // відповіді на поставлені вище запитання. Перед відповідю треба роздрукувати саме питання.
// Правильно обирайте типи даних та назви змінних чи констант.
// Публікація:
// Створити папку в своєму репозиторії в github та завантажити туди main.go файл, в котрому буде зроблено дане завдання.
var (
	apple = 5.99
	pear  = 7
	money = 23
)

func main() {
	fmt.Println("1. Скільки грошей треба витратити, щоб купити 9 яблук та 8 груш?")
	fmt.Println("Кількість грошей які потрібні для покупки 9 яблук та 8 груш:", apple*9+float64(pear)*8)
	fmt.Println("2. Скільки груш ми можемо купити?")
	fmt.Println("Кількість груш які ми можемо купити:", money/pear)
	fmt.Println("3. Скільки яблук ми можемо купити?")
	fmt.Println("Кількість яблук які ми можемо купити:", float64(money)/apple)
	fmt.Println("4. Чи ми можемо купити 2 груші та 2 яблука?")
	if sum := apple*2 + float64(pear*2); sum < float64(money) {
		fmt.Println("Чи можемо ми купити 2 груші та 2 яблука? Так, можемо. Вартість покупки буде:", sum)
	} else {
		fmt.Println("Чи можемо ми купити 2 груші та 2 яблука? Ні, не можемо. Вартість покупки перевищує кількість грошей:", sum)
	}
}
